hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu2/F2838x_ROM/inc/hw_mcanss.h
#define MCAN_ILE_EINT1_SHIFT                               (1U)
#define MCAN_ILE_EINT1_MASK                                (0x00000002U)

#define MCAN_GFC_RRFE_SHIFT                                (0U)
#define MCAN_GFC_RRFE_MASK                                 (0x00000001U)

#define MCAN_GFC_RRFS_SHIFT                                (1U)
#define MCAN_GFC_RRFS_MASK                                 (0x00000002U)

#define MCAN_GFC_ANFE_SHIFT                                (2U)
#define MCAN_GFC_ANFE_MASK                                 (0x0000000cU)

#define MCAN_GFC_ANFS_SHIFT                                (4U)
#define MCAN_GFC_ANFS_MASK                                 (0x00000030U)

#define MCAN_SIDFC_FLSSA_SHIFT                             (2U)
#define MCAN_SIDFC_FLSSA_MASK                              (0x0000fffcU)

#define MCAN_SIDFC_LSS_SHIFT                               (16U)
#define MCAN_SIDFC_LSS_MASK                                (0x00ff0000U)

#define MCAN_XIDFC_FLESA_SHIFT                             (2U)
#define MCAN_XIDFC_FLESA_MASK                              (0x0000fffcU)

#define MCAN_XIDFC_LSE_SHIFT                               (16U)
#define MCAN_XIDFC_LSE_MASK                                (0x007f0000U)

#define MCAN_XIDAM_EIDM_SHIFT                              (0U)
#define MCAN_XIDAM_EIDM_MASK                               (0x1fffffffU)

#define MCAN_HPMS_BIDX_SHIFT                               (0U)
#define MCAN_HPMS_BIDX_MASK                                (0x0000003fU)

#define MCAN_HPMS_MSI_SHIFT                                (6U)
#define MCAN_HPMS_MSI_MASK                                 (0x000000c0U)

#define MCAN_HPMS_FIDX_SHIFT                               (8U)
#define MCAN_HPMS_FIDX_MASK                                (0x00007f00U)

#define MCAN_HPMS_FLST_SHIFT                               (15U)
#define MCAN_HPMS_FLST_MASK                                (0x00008000U)

#define MCAN_NDAT1_ND0_SHIFT                               (0U)
#define MCAN_NDAT1_ND0_MASK                                (0x00000001U)

#define MCAN_NDAT1_ND1_SHIFT                               (1U)
#define MCAN_NDAT1_ND1_MASK                                (0x00000002U)

#define MCAN_NDAT1_ND2_SHIFT                               (2U)
#define MCAN_NDAT1_ND2_MASK                                (0x00000004U)

#define MCAN_NDAT1_ND3_SHIFT                               (3U)
#define MCAN_NDAT1_ND3_MASK                                (0x00000008U)

#define MCAN_NDAT1_ND4_SHIFT                               (4U)
#define MCAN_NDAT1_ND4_MASK                                (0x00000010U)

#define MCAN_NDAT1_ND5_SHIFT                               (5U)
#define MCAN_NDAT1_ND5_MASK                                (0x00000020U)

#define MCAN_NDAT1_ND6_SHIFT                               (6U)
#define MCAN_NDAT1_ND6_MASK                                (0x00000040U)

#define MCAN_NDAT1_ND7_SHIFT                               (7U)
#define MCAN_NDAT1_ND7_MASK                                (0x00000080U)

#define MCAN_NDAT1_ND8_SHIFT                               (8U)
#define MCAN_NDAT1_ND8_MASK                                (0x00000100U)

#define MCAN_NDAT1_ND9_SHIFT                               (9U)
#define MCAN_NDAT1_ND9_MASK                                (0x00000200U)

#define MCAN_NDAT1_ND10_SHIFT                              (10U)
#define MCAN_NDAT1_ND10_MASK                               (0x00000400U)

#define MCAN_NDAT1_ND11_SHIFT                              (11U)
#define MCAN_NDAT1_ND11_MASK                               (0x00000800U)

#define MCAN_NDAT1_ND12_SHIFT                              (12U)
#define MCAN_NDAT1_ND12_MASK                               (0x00001000U)

#define MCAN_NDAT1_ND13_SHIFT                              (13U)
#define MCAN_NDAT1_ND13_MASK                               (0x00002000U)

#define MCAN_NDAT1_ND14_SHIFT                              (14U)
#define MCAN_NDAT1_ND14_MASK                               (0x00004000U)

#define MCAN_NDAT1_ND15_SHIFT                              (15U)
#define MCAN_NDAT1_ND15_MASK                               (0x00008000U)

#define MCAN_NDAT1_ND16_SHIFT                              (16U)
#define MCAN_NDAT1_ND16_MASK                               (0x00010000U)

#define MCAN_NDAT1_ND17_SHIFT                              (17U)
#define MCAN_NDAT1_ND17_MASK                               (0x00020000U)

#define MCAN_NDAT1_ND18_SHIFT                              (18U)
#define MCAN_NDAT1_ND18_MASK                               (0x00040000U)

#define MCAN_NDAT1_ND19_SHIFT                              (19U)
#define MCAN_NDAT1_ND19_MASK                               (0x00080000U)

#define MCAN_NDAT1_ND20_SHIFT                              (20U)
#define MCAN_NDAT1_ND20_MASK                               (0x00100000U)

#define MCAN_NDAT1_ND21_SHIFT                              (21U)
#define MCAN_NDAT1_ND21_MASK                               (0x00200000U)

#define MCAN_NDAT1_ND22_SHIFT                              (22U)
#define MCAN_NDAT1_ND22_MASK                               (0x00400000U)

#define MCAN_NDAT1_ND23_SHIFT                              (23U)
#define MCAN_NDAT1_ND23_MASK                               (0x00800000U)

#define MCAN_NDAT1_ND24_SHIFT                              (24U)
#define MCAN_NDAT1_ND24_MASK                               (0x01000000U)

#define MCAN_NDAT1_ND25_SHIFT                              (25U)
#define MCAN_NDAT1_ND25_MASK                               (0x02000000U)

#define MCAN_NDAT1_ND26_SHIFT                              (26U)
#define MCAN_NDAT1_ND26_MASK                               (0x04000000U)

#define MCAN_NDAT1_ND27_SHIFT                              (27U)
#define MCAN_NDAT1_ND27_MASK                               (0x08000000U)

#define MCAN_NDAT1_ND28_SHIFT                              (28U)
#define MCAN_NDAT1_ND28_MASK                               (0x10000000U)

#define MCAN_NDAT1_ND29_SHIFT                              (29U)
#define MCAN_NDAT1_ND29_MASK                               (0x20000000U)

#define MCAN_NDAT1_ND30_SHIFT                              (30U)
#define MCAN_NDAT1_ND30_MASK                               (0x40000000U)

