hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu2/F2838x_ROM/inc/hw_mcanss.h
#define MCAN_TXBCR_CR6_SHIFT                               (6U)
#define MCAN_TXBCR_CR6_MASK                                (0x00000040U)

#define MCAN_TXBCR_CR7_SHIFT                               (7U)
#define MCAN_TXBCR_CR7_MASK                                (0x00000080U)

#define MCAN_TXBCR_CR8_SHIFT                               (8U)
#define MCAN_TXBCR_CR8_MASK                                (0x00000100U)

#define MCAN_TXBCR_CR9_SHIFT                               (9U)
#define MCAN_TXBCR_CR9_MASK                                (0x00000200U)

#define MCAN_TXBCR_CR10_SHIFT                              (10U)
#define MCAN_TXBCR_CR10_MASK                               (0x00000400U)

#define MCAN_TXBCR_CR11_SHIFT                              (11U)
#define MCAN_TXBCR_CR11_MASK                               (0x00000800U)

#define MCAN_TXBCR_CR12_SHIFT                              (12U)
#define MCAN_TXBCR_CR12_MASK                               (0x00001000U)

#define MCAN_TXBCR_CR13_SHIFT                              (13U)
#define MCAN_TXBCR_CR13_MASK                               (0x00002000U)

#define MCAN_TXBCR_CR14_SHIFT                              (14U)
#define MCAN_TXBCR_CR14_MASK                               (0x00004000U)

#define MCAN_TXBCR_CR15_SHIFT                              (15U)
#define MCAN_TXBCR_CR15_MASK                               (0x00008000U)

#define MCAN_TXBCR_CR16_SHIFT                              (16U)
#define MCAN_TXBCR_CR16_MASK                               (0x00010000U)

#define MCAN_TXBCR_CR17_SHIFT                              (17U)
#define MCAN_TXBCR_CR17_MASK                               (0x00020000U)

#define MCAN_TXBCR_CR18_SHIFT                              (18U)
#define MCAN_TXBCR_CR18_MASK                               (0x00040000U)

#define MCAN_TXBCR_CR19_SHIFT                              (19U)
#define MCAN_TXBCR_CR19_MASK                               (0x00080000U)

#define MCAN_TXBCR_CR20_SHIFT                              (20U)
#define MCAN_TXBCR_CR20_MASK                               (0x00100000U)

#define MCAN_TXBCR_CR21_SHIFT                              (21U)
#define MCAN_TXBCR_CR21_MASK                               (0x00200000U)

#define MCAN_TXBCR_CR22_SHIFT                              (22U)
#define MCAN_TXBCR_CR22_MASK                               (0x00400000U)

#define MCAN_TXBCR_CR23_SHIFT                              (23U)
#define MCAN_TXBCR_CR23_MASK                               (0x00800000U)

#define MCAN_TXBCR_CR24_SHIFT                              (24U)
#define MCAN_TXBCR_CR24_MASK                               (0x01000000U)

#define MCAN_TXBCR_CR25_SHIFT                              (25U)
#define MCAN_TXBCR_CR25_MASK                               (0x02000000U)

#define MCAN_TXBCR_CR26_SHIFT                              (26U)
#define MCAN_TXBCR_CR26_MASK                               (0x04000000U)

#define MCAN_TXBCR_CR27_SHIFT                              (27U)
#define MCAN_TXBCR_CR27_MASK                               (0x08000000U)

#define MCAN_TXBCR_CR28_SHIFT                              (28U)
#define MCAN_TXBCR_CR28_MASK                               (0x10000000U)

#define MCAN_TXBCR_CR29_SHIFT                              (29U)
#define MCAN_TXBCR_CR29_MASK                               (0x20000000U)

#define MCAN_TXBCR_CR30_SHIFT                              (30U)
#define MCAN_TXBCR_CR30_MASK                               (0x40000000U)

#define MCAN_TXBCR_CR31_SHIFT                              (31U)
#define MCAN_TXBCR_CR31_MASK                               (0x80000000U)

#define MCAN_TXBTO_TO0_SHIFT                               (0U)
#define MCAN_TXBTO_TO0_MASK                                (0x00000001U)

#define MCAN_TXBTO_TO1_SHIFT                               (1U)
#define MCAN_TXBTO_TO1_MASK                                (0x00000002U)

#define MCAN_TXBTO_TO2_SHIFT                               (2U)
#define MCAN_TXBTO_TO2_MASK                                (0x00000004U)

#define MCAN_TXBTO_TO3_SHIFT                               (3U)
#define MCAN_TXBTO_TO3_MASK                                (0x00000008U)

#define MCAN_TXBTO_TO4_SHIFT                               (4U)
#define MCAN_TXBTO_TO4_MASK                                (0x00000010U)

#define MCAN_TXBTO_TO5_SHIFT                               (5U)
#define MCAN_TXBTO_TO5_MASK                                (0x00000020U)

#define MCAN_TXBTO_TO6_SHIFT                               (6U)
#define MCAN_TXBTO_TO6_MASK                                (0x00000040U)

#define MCAN_TXBTO_TO7_SHIFT                               (7U)
#define MCAN_TXBTO_TO7_MASK                                (0x00000080U)

#define MCAN_TXBTO_TO8_SHIFT                               (8U)
#define MCAN_TXBTO_TO8_MASK                                (0x00000100U)

#define MCAN_TXBTO_TO9_SHIFT                               (9U)
#define MCAN_TXBTO_TO9_MASK                                (0x00000200U)

#define MCAN_TXBTO_TO10_SHIFT                              (10U)
#define MCAN_TXBTO_TO10_MASK                               (0x00000400U)

#define MCAN_TXBTO_TO11_SHIFT                              (11U)
#define MCAN_TXBTO_TO11_MASK                               (0x00000800U)

#define MCAN_TXBTO_TO12_SHIFT                              (12U)
#define MCAN_TXBTO_TO12_MASK                               (0x00001000U)

#define MCAN_TXBTO_TO13_SHIFT                              (13U)
#define MCAN_TXBTO_TO13_MASK                               (0x00002000U)

#define MCAN_TXBTO_TO14_SHIFT                              (14U)
#define MCAN_TXBTO_TO14_MASK                               (0x00004000U)

#define MCAN_TXBTO_TO15_SHIFT                              (15U)
#define MCAN_TXBTO_TO15_MASK                               (0x00008000U)

#define MCAN_TXBTO_TO16_SHIFT                              (16U)
#define MCAN_TXBTO_TO16_MASK                               (0x00010000U)

#define MCAN_TXBTO_TO17_SHIFT                              (17U)
#define MCAN_TXBTO_TO17_MASK                               (0x00020000U)

#define MCAN_TXBTO_TO18_SHIFT                              (18U)
#define MCAN_TXBTO_TO18_MASK                               (0x00040000U)

#define MCAN_TXBTO_TO19_SHIFT                              (19U)
#define MCAN_TXBTO_TO19_MASK                               (0x00080000U)

#define MCAN_TXBTO_TO20_SHIFT                              (20U)
#define MCAN_TXBTO_TO20_MASK                               (0x00100000U)

#define MCAN_TXBTO_TO21_SHIFT                              (21U)
#define MCAN_TXBTO_TO21_MASK                               (0x00200000U)

